#include <stdio.h>
int main02()
{
	int as[]={10,20,30,40,50};
	int *p;
	/*1  int型指针 指向int型数组 的意义*/
	//一种遍历空间数组的方式
	//p = &as[0];//&  *(as+0)//&与*互逆//(as+0)//as
	p = as;
	
	/*2 比较 指针+1与数组名+1的区别 */
	printf("%d %d %d %d\n", as, as + 1, p, p + 1);//没有区别，都是地址

	/*3 深度理解： 
	数组名+[下标] 与 *(指针+移动) 与 指针+[下标] 的应用效果*/

	printf("%d %d %d %d\n", as[2], *(as + 2), *(p+2), p[2]);
	//前面是结论，后面是过程，效果没区别
	
	/*4 利用指针变量实现数组的便利操作*/
	for ( int i=0;i<5 ;i++ )
	{
		printf("%d %d\n",as[i],*p++);
		//*p++,是先给后加，先给p的值给*，p再++，运算顺序是从右向左，如果有括号就是内容++
	}

	return 0;
}